# DT_ResetAllDataTags

## Description
Resets all Data Tags in the active document. Usefull if you have Data Tags showing data from worksheets and you want them to update after worksheet update.

```pascal
PROCEDURE DT_ResetAllDataTags;
```

```python
def vs.DT_ResetAllDataTags():
    return None
```

## Version
Availability: from Vectorworks 2025

## Category
* Data Tag Interface Library